[
  {
    "company_name": "Tanium",
    "position": "Software Engineer Intern",
    "company_link": "",
    "description": [
      "Developed a Kubernetes operator in Go to automate installs and upgrades for cloud solutions.",
      "Integrated K8s operator into CI/CD pipelines, improving deployment workflows and monitoring.",
      "Conducted optimization and unit testing to ensure the operator met high efficiency standards.",
      "Managed custom resources, enhancing operator’s ability to handle complex configurations."
    ],
    "dates": "May 2024 - August 2024",
    "location": "Durham, NC"
  },
  {
    "company_name": "Duke University",
    "position": "ML Research Assistant",
    "company_link": "",
    "description": [
      "Conducted research on novel Protein Language Model (PLM) architectures under Dr. Alizadeh.",
      "Combined protein sequence/structure data; created models for improved predictive performance.",
      "Leveraged Pytorch to build and test neural network architectures, implementing deep learning."
    ],
    "dates": "April 2024 - August 2024",
    "location": "Durham, NC"
  },
  {
    "company_name": "Duke University",
    "position": "Mobile App Developer",
    "company_link": "",
    "description": [
      "Developed an app for professors to post quizzes online, engaging 500+ active users.",
      "Utilized Firebase to develop a question bank module and integrated a question release feature.",
      "Implemented real-time notifications by utilizing Firebase Cloud Messaging topic messaging.",
      "Developed a server in Java using Spring Boot, handling network requests to send notifications."
    ],
    "dates": "August 2023 - April 2024",
    "location": "Durham, NC"
  },
  {
    "company_name": "STATS199",
    "position": "Teaching Assistant",
    "company_link": "https://stat.duke.edu/",
    "description": [
      "Led discussion sections with 35+ students, covering course content in R; graded assignments.",
      "Mentored students; answered questions through weekly office hours & class discussion forums."
    ],
    "dates": "August 2023 - May 2024",
    "location": "Durham, NC"
  },
  {
    "company_name": "Valensas",
    "position": "Software Engineer Intern",
    "company_link": "https://valensas.com/",
    "description": [
      "Developed a React web app for enabling users to make purchases with a pre-authorized payment method, even in areas with limited internet connectivity.",
      "Built web-based interface for that enables users to view transaction history.",
      "Created a panel with React Admin to efficiently manage and monitor flights and transactions.",
      "Utilized Rest API for flight-related tasks: retrieving flight data and creating/terminating flights.",
      "Leveraged the Multipeer Connectivity Framework to enable transaction history synchronization."
    ],
    "dates": "May 2023 - Aug 2023",
    "location": "San Francisco, CA"
  },
  {
    "company_name": "Duke Applied Machine Learning",
    "position": "ML Engineer",
    "company_link": "https://www.dukeaml.com/",
    "description": [
      "Working for the project AMP®-Parkinson's Disease Progression Prediction.",
      "Developed a predictive model measuring the progression of Parkinson's disease.",
      "Employed ML algorithms to analyze the data, including supervised and unsupervised learning.",
      "Utilized Scikit-learn, Pandas, and NumPy for data processing and model development."

    ],
    "dates": "February 2023 - May 2023",
    "location": "Durham, NC"
  },
  {
    "company_name": "Recly",
    "position": "Software Development Intern",
    "company_link": "https://www.reclyapp.com/",
    "description": [
      "Developed solutions for critical bugs in Recly, a workout partner connection app written in React.",
      "Enhanced the Chat section by message notifications and improved message synchronization.",
      "Extended code to support international phone number sign-in, adding 200+ international users.",
      "Cut build times from 5 minutes to 20 seconds by leading backend environment overhaul."
    ],
    "dates": "May 2022 - Aug 2022",
    "location": "Durham, NC"
  }
]