[
  {
    "company_name": "Duke Statistical Science Department",
    "position": "Teaching Assistant",
    "company_link": "https://stat.duke.edu/",
    "description": [
      "Led discussion sections with 20 students, covering course content in R; graded attendance and assignments.",
      "Mentored students and answered questions through weekly office hours and class discussion forums."
    ],
    "dates": "Aug 2023 - Present",
    "location": "Durham, NC"
  },
  {
    "company_name": "Valensas",
    "position": "Software Engineer Intern",
    "company_link": "https://valensas.com/",
    "description": [
      "Developed a web application with React for PayPro that allows users to make purchases and expenses using a pre-authorized payment method, even in areas with limited internet connectivity.",
      "Contributed to the development of a web-based interface for PayPro that enables users to view transaction history.",
      "Created an admin panel using React Admin to efficiently manage and monitor flights and transactions.",
      "Utilized Postman API to perform a range of flight-related tasks, including retrieving flight data through GET requests, creating and terminating flights using POST requests, and initiating provisioning processes for flights.",
      "Created the login page for the application using React and JavaScript both for the web platform and the admin panel.",
      "Leveraged the Multipeer Connectivity Framework to enable transaction history synchronization for flight attendants across all devices within the app."
    ],
    "dates": "May 2023 - Aug 2023",
    "location": "Istanbul, Turkey"
  },
  {
    "company_name": "Recly",
    "position": "Software Development Intern",
    "company_link": "https://www.reclyapp.com/",
    "description": [
      "Developed solutions for critical bugs in Recly, a workout partner connection app written in React.",
      "Enhanced the Messages section by message notifications and improved message synchronization using ReactNative.",
      "Designed and implemented software features that improved the user experience and increased user retention by 40%.",
      "Extended code so that users could sign in with international phone numbers, adding 200+ international users."
    ],
    "dates": "May 2022 - Aug 2022",
    "location": "Durham, NC"
  },
  {
    "company_name": "DAML Group",
    "position": "Machine Learning Engineer",
    "company_link": "https://www.dukeaml.com/",
    "description": [
      "Working for the project AMP®-Parkinson's Disease Progression Prediction.",
      "Developed a predictive model for MDS-UPDR scores, which measures the progression of Parkinson's disease.",
      "Employed machine learning algorithms to analyze and interpret the data, including supervised and unsupervised learning techniques.",
      "Utilized Python and libraries such as Scikit-learn, Pandas, and NumPy for data processing and model development."
    ],
    "dates": "Feb 2023",
    "location": "Durham, NC"
  },
  {
    "company_name": "Ataol Group",
    "position": "Data Analyst Intern",
    "company_link": "https://www.linkedin.com/company/ataol/?trk=public_profile_experience-group-header&originalSubdomain=tr",
    "description": [
      "Conducted software research and provided benefit reports on platforms the company wants to use.",
      "Organized software partnership meetings for company leadership.",
      "Wrote weekly data articles for the company's social media."
    ],
    "dates": "March 2023",
    "location": "Istanbul, Turkey (remote)"
  }
]